#include "ParaProcess.h"
#include "ExternPrototype.h"

#define DEFAULTPARATABLE_LEN	  (sizeof(DefaultParaTable)/sizeof(DefaultSysParaType))    // 初始化参数数目

DefaultSysParaType  DefaultParaTable[]=
{
    //参数结构：数据,属性，上限，下限

    //属性定义
    //BIT0	1 允许用户更改  		0  不允许用户更改
    //BIT1	1 允许运行时更改  	0  不允许运行时更改
    //BIT2	1 有符号        		0  无符号
    //BIT3	1 保留  			0  保留
	{	NULL                         	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	0	占位
	{	SOFT_VER                     	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	1	软件版本号
	{	HARD_VER                     	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	2	硬件版本号
	{	DEFECT_CODE                  	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	3	告警码
	{	SYS_ST_CODE                  	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	4	系统状态
	{	V_FEEDBACK                   	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	5	速度反馈
	{	T_SET                        	,	0	,	{	0	,	0	,	1	,	0	,	}	,	27648	,	-27648	,	}	,	//	6	转矩设定
	{	V_SET                        	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	7	速度设定
	{	I_FEEDBACK                   	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	8	电流反馈
	{	P_SET                        	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	9	压力设定
	{	P_FEEDBACK                   	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	10	压力反馈
	{	IGBT_TEMP                    	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	11	IGBT温度
	{	MOTO_TEMP                    	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	12	电机温度
	{	C_VOL                        	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	13	母线电压
	{	TEMP0                        	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	14	T0温度
	{	TEMP1                        	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	15	T1温度
	{	TEMP2                        	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	16	T2温度
	{	MOTO_TYPE                    	,	4	,	{	1	,	0	,	0	,	0	,	}	,	20	,	0	,	}	,	//	17	电机型号
	{	COMM_ADDR                    	,	1	,	{	1	,	0	,	0	,	0	,	}	,	250	,	1	,	}	,	//	18	分机地址
	{	COMM_BDR                     	,	6	,	{	1	,	0	,	0	,	0	,	}	,	9	,	1	,	}	,	//	19	通讯波特率
	{	PW_ON_DISP                   	,	3	,	{	1	,	0	,	0	,	0	,	}	,	15	,	1	,	}	,	//	20	上电开机默认显示运行参数序号
	{	MOUT1_SEL                    	,	2	,	{	1	,	1	,	0	,	0	,	}	,	32	,	0	,	}	,	//	21	MOUT1输出量类别选择
	{	MOUT2_SEL                    	,	1	,	{	1	,	1	,	0	,	0	,	}	,	32	,	0	,	}	,	//	22	MOUT2输出量类别选择
	{	MAX_V                        	,	3100	,	{	1	,	0	,	0	,	0	,	}	,	4000	,	1	,	}	,	//	23	最高转速
	{	MAX_I                        	,	155	,	{	1	,	0	,	0	,	0	,	}	,	200	,	100	,	}	,	//	24	最大电流
	{	OVER_I_C                     	,	550	,	{	1	,	0	,	0	,	0	,	}	,	700	,	300	,	}	,	//	25	额定电流，超载门槛电流
	{	OVER_I_T                     	,	3	,	{	1	,	0	,	0	,	0	,	}	,	30	,	1	,	}	,	//	26	超载延时
	{	MOTO_SAFE_TEMP               	,	140	,	{	1	,	1	,	0	,	0	,	}	,	300	,	0	,	}	,	//	27	电机过热温度保护点
	{	ALARM_LOCK                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	28	驱动器低16位告警停机锁定(1=锁定)
	{	ALARM_MASK                   	,	0x0100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	29	驱动器低16位告警屏蔽(1=屏蔽)
	{	OUT0_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	30	OUT00输出功能选择
	{	OUT1_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	31	OUT01输出功能选择
	{	OUT2_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	32	OUT02输出功能选择
	{	WORK_MOD                     	,	2	,	{	1	,	1	,	0	,	0	,	}	,	3	,	1	,	}	,	//	33	工作模式选择
	{	BRAKE_ON_DELAY               	,	320	,	{	1	,	1	,	1	,	0	,	}	,	5000	,	-5000	,	}	,	//	34	制动器开延时
	{	BRAKE_OFF_DELAY              	,	556	,	{	1	,	1	,	1	,	0	,	}	,	10000	,	-10000	,	}	,	//	35	制动器关延时
	{	T_SET_SCALE                  	,	1024	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	36	力矩设定增益调节
	{	T_SET_OFFSET                 	,	0	,	{	1	,	1	,	1	,	0	,	}	,	5000	,	-5000	,	}	,	//	37	力矩设定零偏
	{	T_TIME                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	30000	,	0	,	}	,	//	38	力矩梯度限制
	{	V_PP                         	,	1300	,	{	1	,	1	,	0	,	0	,	}	,	10000	,	0	,	}	,	//	39	速度环比例系数
	{	V_PI                         	,	50	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	1	,	}	,	//	40	速度环积分常数
	{	V_FB_OFFSET                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	5000	,	-5000	,	}	,	//	41	速度环反馈零偏
	{	V_SET_SCALE                  	,	1024	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	1	,	}	,	//	42	速度环设定增益调节
	{	V_SET_OFFSET                 	,	0	,	{	1	,	1	,	1	,	0	,	}	,	5000	,	-5000	,	}	,	//	43	速度环设定零偏
	{	V_DEAD_VAL                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	250	,	0	,	}	,	//	44	速度设定死区
	{	V_UP_TIME                    	,	44	,	{	1	,	1	,	0	,	0	,	}	,	30000	,	0	,	}	,	//	45	速度环上升梯度延时
	{	V_DOWN_TIME                  	,	44	,	{	1	,	1	,	0	,	0	,	}	,	30000	,	0	,	}	,	//	46	速度环下降梯度延时
	{	V_DIR_MOD                    	,	1	,	{	1	,	0	,	0	,	0	,	}	,	1	,	0	,	}	,	//	47	速度环电机方向选择
	{	P_PP                         	,	5000	,	{	1	,	1	,	0	,	0	,	}	,	20000	,	1000	,	}	,	//	48	位置环比例系数
	{	P_PI                         	,	700	,	{	1	,	1	,	0	,	0	,	}	,	2000	,	100	,	}	,	//	49	位置环前馈系数
	{	P_FB_SCAL                    	,	3000	,	{	1	,	1	,	0	,	0	,	}	,	3001	,	0	,	}	,	//	50	速度超限值
	{	RESERVE_PARA_51              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	51	预留用参数_51
	{	RESERVE_PARA_52              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	52	预留用参数_52
	{	BKFAN                        	,	0	,	{	1	,	1	,	0	,	0	,	}	,	2	,	0	,	}	,	//	53	抱闸风机控制逻辑：0=风机与使能联动；1=风机强行关；2=风机强行开
	{	DIH_STA                      	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	54	DI口状态高16位
	{	RESERVE_PARA_55              	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	55	预留用参数_55
	{	DISCHARGE_TIM                	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	56	每3秒泄放时间
	{	DISCHARGE_ACCTIM             	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	57	泄放累计时间
	{	DISCHARGE_ACCOUT             	,	300	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	1	,	}	,	//	58	泄放累计时间退出斜率分母
	{	DISCHARGE_ACCTH              	,	150	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	59	泄放累计时间报警门槛
	{	S_UP_TIME                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	3000	,	0	,	}	,	//	60	S曲线上升时间
	{	S_DOWN_TIME                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	3000	,	0	,	}	,	//	61	S曲线下降时间
	{	ALARM_AUTO_RST_EN            	,	0x0002	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	62	驱动器低16位故障手自动复位:0=手动；1=自动
	{	DEFECTINSEL                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	63	位置超差
	{	ANALOG_IN0                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	64	模拟输入0
	{	ANALOG_IN0_PFIL              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	65	模拟输入0滤波系数
	{	FLASHSAVEFLAG                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	66	DSP回复设置为保存时1：不复位模式2：正常模式
	{	MAX_T                        	,	155	,	{	1	,	0	,	0	,	0	,	}	,	10000	,	1	,	}	,	//	67	最大扭矩
	{	OPEN_T_LIMIT                 	,	0x45AD	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	68	转矩限制值
	{	MOTO_HUMID_EN                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	69	电机温度湿度选择
	{	LIMIT_T                      	,	0x6C00	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	70	转矩限制值，带转矩限制的速度控制
	{	LIMIT_V                      	,	0x6C00	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	71	速度限制值，带速度限制的位置控制
	{	SCALE_A                      	,	11	,	{	1	,	1	,	0	,	0	,	}	,	100	,	1	,	}	,	//	72	电机位置传递比分子，对应电机负载终端圈数
	{	SCALE_B                      	,	25000	,	{	1	,	1	,	0	,	0	,	}	,	40000	,	1	,	}	,	//	73	电机位置传递比分母，对应电机圈数
	{	OVER_I_TOTAL                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	74	超载量
	{	Q_RESISTANCE                 	,	115	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	75	q轴电阻
	{	PM_FLUX                      	,	308	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	76	永磁磁链
	{	MOTOR_LD                     	,	3	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	77	D轴电感
	{	MOTOR_LQ                     	,	3	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	78	Q轴电感
	{	SPEED_OVERPROOF_T            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	100	,	0	,	}	,	//	79	速度超差时间
	{	OUT3_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	80	OUT03输出功能选择
	{	OUT4_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	81	OUT04输出功能选择
	{	CABINET_TEMP0_ADJ            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	82	PT100温度调节
	{	NORMAL_PWM_FREQ              	,	4000	,	{	1	,	1	,	0	,	0	,	}	,	10000	,	0	,	}	,	//	83	定频频率（为 0 时自动变频）
	{	STAR_PWM_TFREQ               	,	4000	,	{	1	,	1	,	0	,	0	,	}	,	10000	,	2000	,	}	,	//	84	自动变频初始频率
	{	MAX_PWM_FREQ                 	,	4000	,	{	1	,	1	,	0	,	0	,	}	,	10000	,	2000	,	}	,	//	85	自动变频最大频率
	{	MIN_PWM_FREQ                 	,	4000	,	{	1	,	1	,	0	,	0	,	}	,	10000	,	2000	,	}	,	//	86	自动变频最小频率
	{	PWM_time_set                 	,	5	,	{	1	,	1	,	0	,	0	,	}	,	120	,	1	,	}	,	//	87	自动变频最小时间间隔
	{	PWM_FREQ_set                 	,	1000	,	{	1	,	1	,	0	,	0	,	}	,	2000	,	100	,	}	,	//	88	自动变频变频频率步进
	{	PWM_temp_set                 	,	2	,	{	1	,	1	,	0	,	0	,	}	,	5	,	1	,	}	,	//	89	自动变频温度步距
	{	PWM_print                    	,	4000	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	90	实时运行频率
	{	HAND_SLOW_SPEED              	,	300	,	{	1	,	1	,	0	,	0	,	}	,	2100	,	0	,	}	,	//	91	手动慢速
	{	FAN_ON_TEMP                  	,	60	,	{	1	,	1	,	1	,	0	,	}	,	150	,	-40	,	}	,	//	92	风机关闭温度
	{	HAND_FAST_SPEED              	,	1000	,	{	1	,	1	,	0	,	0	,	}	,	2100	,	0	,	}	,	//	93	手动快速
	{	FAN_OFF_TEMP                 	,	40	,	{	1	,	1	,	1	,	0	,	}	,	150	,	-40	,	}	,	//	94	风机关闭温度
	{	DI_STA                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	95	DI口状态
	{	DO_STA                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	96	DO口状态
	{	ERRSAVE_ENABLE               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	97	故障信息存盘0=启用；非0=禁止
	{	MOTO_HUMID_OFFSET            	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	98	T3湿度零偏
	{	ERRSAVE_ADDR_DISPL           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	99	故障信息存盘地址低16位显示
	{	ERRSAVE_ADDR_DISPH           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	100	故障信息存盘地址高16位显示
	{	RESERVE_PARA_101             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	101	预留用参数_101
	{	RESERVE_PARA_102             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	102	预留用参数_102
	{	RESERVE_PARA_103             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	103	预留用参数_103
	{	RESERVE_PARA_104             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	104	预留用参数_104
	{	RESERVE_PARA_105             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	105	预留用参数_105
	{	RESERVE_PARA_106             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	106	预留用参数_106
	{	RESERVE_PARA_107             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	107	预留用参数_107
	{	RESERVE_PARA_108             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	108	预留用参数_108
	{	MOTOR_TEMP0_ADJ              	,	700	,	{	1	,	1	,	0	,	0	,	}	,	5000	,	0	,	}	,	//	109	原电机温度校准参数，已不用
	{	MOTOR_TEMP0_SEL              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	110	原电机温度传感器选择：0 KTY84；1 KTY83，已不用
	{	OUT5_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	111	OUT05输出功能选择
	{	OUT6_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	112	OUT06输出功能选择
	{	ARM_BUILD_YEAR               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	113	ARM编译年份
	{	ARM_BUILD_DATE               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	114	ARM编译月日
	{	ARM_BUILD_TIME               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	115	ARM编译时分
	{	DSP_BUILD_YEAR               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	116	DSP编译年份
	{	DSP_BUILD_DATE               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	117	DSP编译月日
	{	DSP_BUILD_TIME               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	118	DSP编译时分
	{	OUT7_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	119	OUT07输出功能选择
	{	AI0_OFFSET                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	120	AI0输入零偏
	{	AI0_SCALE                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	121	AI0输入增益调节
	{	MOTO_HUMID_K                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	122	T3湿度增益
	{	P_PV                         	,	200	,	{	1	,	1	,	0	,	0	,	}	,	2000	,	0	,	}	,	//	123	位置环速度限制值
	{	EX_DEFECT_CODE               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	124	扩展告警代码
	{	ERR_STOP_NUM                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	125	强制停机故障自动复位次数
	{	ERR_STOP_RST_TIM             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	30	,	0	,	}	,	//	126	强制停机故障自动复位间隔时间
	{	CTRL_CMD                     	,	0	,	{	1	,	1	,	0	,	0	,	}	,	60	,	0	,	}	,	//	127	强制停机故障停机解除时间
	{	MOTO_PP_NUM                  	,	3	,	{	1	,	0	,	0	,	0	,	}	,	99	,	1	,	}	,	//	128	电机极对数
	{	CODER_TYPE                   	,	1	,	{	1	,	0	,	0	,	0	,	}	,	6	,	1	,	}	,	//	129	编码器型号
	{	HSD_T                        	,	1000	,	{	1	,	0	,	0	,	0	,	}	,	10000	,	1	,	}	,	//	130	缓上电延时
	{	IGBT_SAFE_TEMP               	,	105	,	{	1	,	1	,	0	,	0	,	}	,	110	,	0	,	}	,	//	131	IGBT过热温度保护点
	{	EXECP_MASK                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	132	异常停机屏蔽
	{	POWERONENABLE                	,	0	,	{	1	,	0	,	0	,	0	,	}	,	1	,	0	,	}	,	//	133	带使能上电允许
	{	IO_LOGIC_SET                 	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	134	输入输出逻辑电平设置
	{	IN1_SEL                      	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	135	输入功能选择1
	{	IN2_SEL                      	,	1	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	136	输入功能选择2
	{	VFB_SEL                      	,	2	,	{	1	,	0	,	0	,	0	,	}	,	9	,	0	,	}	,	//	137	速度反馈选择：0=测速线圈速度反馈；1=旋变DSP解码速度反馈；2=带开环保护的旋转变压器PMSM控制
	{	V_COMPENSATE                 	,	1	,	{	1	,	0	,	0	,	0	,	}	,	1	,	0	,	}	,	//	138	旋转变压器反馈换向：0=不换；1=换向
	{	P_PACC                       	,	1584	,	{	1	,	1	,	0	,	0	,	}	,	2500	,	1	,	}	,	//	139	位置环加速度
	{	PWM_FREQ_SEL                 	,	1	,	{	1	,	0	,	0	,	0	,	}	,	4	,	0	,	}	,	//	140	PWM频率选择
	{	FW_GAIN                      	,	20	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	141	弱磁增益
	{	FW_T                         	,	20	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	142	弱磁时间常数
	{	ID_MAX                       	,	11184	,	{	1	,	0	,	0	,	0	,	}	,	27648	,	0	,	}	,	//	143	D轴最大电流
	{	RESOLVERERR_C                	,	150	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	144	旋变异常门槛
	{	T_PP3                        	,	10000	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	145	6K力矩环比例系数
	{	T_PI3                        	,	500	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	146	6K力矩环积分常数
	{	P_PDEC                       	,	1584	,	{	1	,	1	,	0	,	0	,	}	,	2500	,	1	,	}	,	//	147	位置环减速度
	{	T_PI4                        	,	100	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	148	8K力矩环积分常数
	{	MOD_CTRL                     	,	0	,	{	1	,	0	,	0	,	0	,	}	,	255	,	0	,	}	,	//	149	工作模式控制字
	{	V_FILT_L1                    	,	12	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	150	速度滤波上限系数
	{	PDECODE_I                    	,	20000	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	151	位置解码I
	{	PDECODE_P                    	,	40000	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	152	位置解码P
	{	VDECODE_F                    	,	12	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	153	速度滤波时间常数
	{	IGBT_SEN_SEL                 	,	1	,	{	1	,	0	,	0	,	0	,	}	,	4	,	0	,	}	,	//	154	IGBT温度传感器选择：0=IGBT内置传感器；1=外置独立传感器
	{	ADC_APP                      	,	748	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	155	AD采样增益误差比例修正系数
	{	ADC_OFFSET                   	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	156	AD采样零点偏移值
	{	COS_OFFSET                   	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	157	COS信号零点偏移值
	{	SIN_OFFSET                   	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	158	SIN信号零点偏移值
	{	SIN_APP                      	,	4090	,	{	1	,	0	,	0	,	0	,	}	,	4500	,	3800	,	}	,	//	159	SIN、COS信号幅值修正系数
	{	ZREF_MID                     	,	16384	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	160	ZREF中点值
	{	IA_MID                       	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	161	A相电流中点值
	{	IB_MID                       	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	162	B相电流中点值
	{	I_SCALE                      	,	18700	,	{	1	,	0	,	0	,	0	,	}	,	30000	,	15000	,	}	,	//	163	电流校准比例
	{	OFFSET_ANGLE                 	,	186	,	{	1	,	1	,	0	,	0	,	}	,	599	,	0	,	}	,	//	164	电机初始偏角
	{	ADJ_INPUT1                   	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	165	调试输入1
	{	ADJ_INPUT2                   	,	1	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	166	调试输入2
	{	ADJ_DISP1                    	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	167	调试显示1
	{	ADJ_DISP2                    	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	168	调试显示2
	{	HFINJE_FREQ                  	,	800	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	169	信号注入频率
	{	HFINJE_AMPL                  	,	34000	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	170	信号注入幅值
	{	HFINJE_PFIL                  	,	10	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	171	信号注入法位置滤波时间常数
	{	HFINJE_PDEP                  	,	1200	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	172	信号注入法位置解码P
	{	HFINJE_PDEI                  	,	20	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	173	信号注入法位置解码I
	{	NSREGN_FILT                  	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	174	磁钢极性识别滤波
	{	HFIWAY_SPEED                 	,	200	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	175	信号注入法切换速度
	{	SMOWAY_SPEED                 	,	250	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	176	滑模观测法切换速度
	{	WAVE_ADJ9                    	,	150	,	{	1	,	1	,	0	,	0	,	}	,	560	,	150	,	}	,	//	177	IGBT风机关断电压：当母线电压低于250V时关断IGBT底部风机
	{	WAVE_ADJ10                   	,	800	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	178	泻放电阻功率
	{	WAVE_ADJ11                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	179	原开环设定速度，未使用
	{	WAVE_ADJ12                   	,	5	,	{	1	,	1	,	0	,	0	,	}	,	100	,	0	,	}	,	//	180	泻放过载时间
	{	WAVE_ADJ13                   	,	5	,	{	1	,	1	,	0	,	0	,	}	,	100	,	0	,	}	,	//	181	泻放过载恢复时间
	{	WAVE_ADJ14                   	,	9	,	{	1	,	1	,	0	,	0	,	}	,	100	,	1	,	}	,	//	182	泻放电阻阻值
	{	WAVE_ADJ15                   	,	10	,	{	1	,	1	,	0	,	0	,	}	,	100	,	0	,	}	,	//	183	泻放过载倍率
	{	WAVE_ADJ16                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	184	预留用参数_184
	{	P_ERR_TH                     	,	1	,	{	1	,	1	,	0	,	0	,	}	,	300	,	1	,	}	,	//	185	速度设定滤波次数
	{	SMOPDIR_COMP                 	,	63000	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	186	滑模观测法正向位置补偿
	{	CAN_CURRE_FIR                	,	1	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	187	CAN上传的电机电流滤波常数
	{	SMONDIR_COMP                 	,	3000	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	188	滑模观测法负向位置补偿
	{	P_FILT_A                     	,	60	,	{	1	,	1	,	0	,	0	,	}	,	300	,	1	,	}	,	//	189	位置环设定滤波系数
	{	P_Q_TH                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	190	压力流量跳变门槛
	{	P_SET_TH                     	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	191	压力设定下跳变门槛
	{	ELE_POS                      	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	192	位置码
	{	FEEDBACK_CAL                 	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	193	模拟速度反馈校准允许
	{	ELE_POS_NUM                  	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32768	,	}	,	//	194	圈数
	{	DISCHARGE_R                  	,	9	,	{	1	,	1	,	0	,	0	,	}	,	100	,	1	,	}	,	//	195	泄放电阻阻值
	{	DISCHARGE_P                  	,	800	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	1	,	}	,	//	196	泄放电阻功率
	{	ERR_OPEN_MASK                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	197	故障继电器断开屏蔽
	{	CAN_MXVOL_FIR                	,	10	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	198	CAN上传的母线电压滤波常数
	{	CAN_SPEED_FIR                	,	5	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	1	,	}	,	//	199	CAN上传的电机速度滤波常数
	{	FUN_MASK                     	,	1	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	200	飞车保护功能屏蔽
	{	FCBHMK                       	,	700	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	201	飞车保护门槛
	{	LD_REALSE_ENABLE             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	202	漏电故障解除允许
	{	OPENLOOP_PP                  	,	800	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	1	,	}	,	//	203	开环控制比例系数
	{	OPENLOOP_PI                  	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	204	开环控制时间常数
	{	OPENLOOP_LSEN                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	205	低速无缝开环允许
	{	SIN_OFFSET2                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	206	SIN零偏
	{	COS_OFFSET2                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	207	COS零偏
	{	SIN_APP2                     	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	208	正余弦信号幅值修正系数: 波谷
	{	SIN_PHASE                    	,	4500	,	{	1	,	1	,	0	,	0	,	}	,	12000	,	0	,	}	,	//	209	SINCOS采样相位调节
	{	MANUF_DEV_NAME_SEL           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	210	从站设备型号选择
	{	RESERVE_PARA_211             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	211	预留用参数_211
	{	CAN232_BAUD                  	,	500	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	212	CAN232波特率
	{	CAN_SEL                      	,	1	,	{	0	,	0	,	0	,	0	,	}	,	1	,	0	,	}	,	//	213	CAN协议选择 0：CAN232  1：CANopen
	{	CO_NODE_ID                   	,	0	,	{	0	,	0	,	0	,	0	,	}	,	127	,	0	,	}	,	//	214	CANopen节点号
	{	CO_GUARD_TIME                	,	1000	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	215	"CANopen Guard Time 守护时间	  Index:0x100C"
	{	CO_LIFE_TIME_FACTOR          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	216	CANopen Life Time Factor 寿命保护因子   Index:0x100D
	{	CO_PRODUCER_HEARTBEAT_TIME   	,	500	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	217	CANopen Producer Heartbeat Time 心跳产生时间  Index:0x1017
	{	CO_RPDO1_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	218	CANopen RPDO1 Cob-ID 高16位
	{	CO_RPDO1_COB_ID_L            	,	0x0200	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	219	CANopen RPDO1 Cob-ID 低16位
	{	CO_RPDO1_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	220	CANopen RPDO1 Transmission Type 传输类型
	{	CO_RPDO2_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	221	CANopen RPDO2 Cob-ID 高16位
	{	CO_RPDO2_COB_ID_L            	,	0x0300	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	222	CANopen RPDO2 Cob-ID 低16位
	{	CO_RPDO2_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	223	CANopen RPDO2 Transmission Type 传输类型
	{	CO_RPDO3_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	224	CANopen RPDO3 Cob-ID 高16位
	{	CO_RPDO3_COB_ID_L            	,	0x0400	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	225	CANopen RPDO3 Cob-ID 低16位
	{	CO_RPDO3_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	226	CANopen RPDO3 Transmission Type 传输类型
	{	CO_RPDO4_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	227	CANopen RPDO4 Cob-ID 高16位
	{	CO_RPDO4_COB_ID_L            	,	0x0500	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	228	CANopen RPDO4 Cob-ID 低16位
	{	CO_RPDO4_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	229	CANopen RPDO4 Transmission Type 传输类型
	{	CO_TPDO1_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	230	CANopen TPDO1 Cob-ID 高16位
	{	CO_TPDO1_COB_ID_L            	,	0x0180	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	231	CANopen TPDO1 Cob-ID 低16位
	{	CO_TPDO1_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	232	CANopen TPDO1 Transmission Type 传输类型
	{	CO_TPDO1_INHIBIT_TIME        	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	233	CANopen TPDO1 Inhibit Time 抑制时间
	{	CO_TPDO1_EVENT_TIMER         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	234	CANopen TPDO1 Event Timer 事件时间
	{	CO_TPDO2_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	235	CANopen TPDO2 Cob-ID 高16位
	{	CO_TPDO2_COB_ID_L            	,	0x0280	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	236	CANopen TPDO2 Cob-ID 低16位
	{	CO_TPDO2_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	237	CANopen TPDO2 Transmission Type 传输类型
	{	CO_TPDO2_INHIBIT_TIME        	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	238	CANopen TPDO2 Inhibit Time 抑制时间
	{	CO_TPDO2_EVENT_TIMER         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	239	CANopen TPDO2 Event Timer 事件时间
	{	CO_TPDO3_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	240	CANopen TPDO3 Cob-ID 高16位
	{	CO_TPDO3_COB_ID_L            	,	0x0380	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	241	CANopen TPDO3 Cob-ID 低16位
	{	CO_TPDO3_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	242	CANopen TPDO3 Transmission Type 传输类型
	{	CO_TPDO3_INHIBIT_TIME        	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	243	CANopen TPDO3 Inhibit Time 抑制时间
	{	CO_TPDO3_EVENT_TIMER         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	244	CANopen TPDO3 Event Timer 事件时间
	{	CO_TPDO4_COB_ID_H            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	245	CANopen TPDO4 Cob-ID 高16位
	{	CO_TPDO4_COB_ID_L            	,	0x0480	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	246	CANopen TPDO4 Cob-ID 低16位
	{	CO_TPDO4_TRANSMISSION_TYPE   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	247	CANopen TPDO4 Transmission Type 传输类型
	{	CO_TPDO4_INHIBIT_TIME        	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	248	CANopen TPDO4 Inhibit Time 抑制时间
	{	CO_TPDO4_EVENT_TIMER         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	249	CANopen TPDO4 Event Timer 事件时间
	{	ARM_DSP_COMMPARA0            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	250	ARM与DSP的通讯控制参数0：bit0=1：强制开启底座风机；bit1=1：开启泄放；bit2=1：开启电机预热
	{	ARM_DSP_COMMPARA1            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	251	ARM与DSP的通讯控制参数1
	{	ARM_DSP_COMMPARA2            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	252	ARM与DSP的通讯控制参数2
	{	ARM_DSP_COMMPARA3            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	253	ARM与DSP的通讯控制参数3
	{	ARM_DSP_COMMPARA4            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	254	ARM与DSP的通讯控制参数4
	{	ARM_DSP_COMMPARA5            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	255	ARM与DSP的通讯控制参数5
	{	DRIVER_NUM                   	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	256	驱动器及弱磁代号
	{	DISCHARGE_VOL                	,	750	,	{	1	,	0	,	0	,	0	,	}	,	800	,	700	,	}	,	//	257	泄放保护点电压
	{	RESERVE_PARA_258             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	258	预留用参数_258
	{	OVER2_VOL                    	,	790	,	{	1	,	1	,	0	,	0	,	}	,	830	,	0	,	}	,	//	259	过压2保护点电压
	{	ALARM_AUTO_RST_ENH           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	260	驱动器高16位故障手自动复位
	{	MOUT2_OFFSET                 	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	261	MOUT2 零偏调节
	{	MOUT2_GAIN                   	,	1024	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	262	MOUT2 增益调节
	{	ALARM_MASKH                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	263	驱动器高16位故障屏蔽
	{	DEFECT_CODEH                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	264	驱动器高16位故障码
	{	MOUT1_GAIN                   	,	1024	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	265	MOUT1 增益调节
	{	MOUT1_OFFSET                 	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	266	MOUT1 零偏调节
	{	ERR_DIP_SELECT               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	267	故障代码显示方式选择
	{	RESERVE_PARA_268             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	268	预留用参数_268
	{	RESERVE_PARA_269             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	269	预留用参数_269
	{	IC_MID                       	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	270	C相电流中点值
	{	MOTOR_MAX_I                  	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	271	标配电机最大限流
	{	RESERVE_PARA_272             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	272	预留用参数_272
	{	RATED_LIMIT_I                	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	273	额定限流
	{	BK_CURR_DISP                 	,	0	,	{	1	,	0	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	274	抱闸电流显示
	{	LOW_VOL                      	,	160	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	275	母线欠压保护点
	{	BK_CURR_MAX                  	,	750	,	{	1	,	1	,	0	,	0	,	}	,	1200	,	0	,	}	,	//	276	抱闸电流上限
	{	BK_CURR_OFFSET               	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	277	抱闸电流零偏
	{	BK_CURR_MIN                  	,	80	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	278	抱闸电流下限
	{	BK_CURR_SCALE                	,	395	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	279	抱闸电流增益
	{	ALARM_LOCKH                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	280	驱动器高16位故障停机锁定
	{	DISCHARGE_RELEASE_VOL        	,	10	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	281	泄放回差电压
	{	RESERVE_PARA_282             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	282	预留用参数_282
	{	OVER1_VOL                    	,	790	,	{	1	,	1	,	0	,	0	,	}	,	830	,	0	,	}	,	//	283	过压1保护点电压
	{	RESERVE_PARA_284             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	284	预留用参数_284
	{	C_VOL_CAL                    	,	4080	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	285	母线电压校准
	{	RESERVE_PARA_286             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	286	预留用参数_286
	{	RESERVE_PARA_287             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	287	预留用参数_287
	{	RESERVE_PARA_288             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	288	预留用参数_288
	{	CHARGE_SLOPE                 	,	20	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	289	充电压差斜率
	{	RESERVE_PARA_290             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	290	预留用参数_290
	{	MOTOR_LIMIT_TEMP             	,	140	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	291	电机过热限温
	{	RESERVE_PARA_292            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	292	预留用参数_292
	{	POWER_IN_LOSE_EN             	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	293	缺相保护允许
	{	RESERVE_PARA_294            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	294	预留用参数_294
	{	DISCHARGE_PROTECT            	,	100	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	295	泄放能量保护
	{	OPEN_LOOP_EN                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	296	开环控制允许: 0不允许，1允许
	{	RESERVE_PARA_297            	,	220	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	297	预留用参数_297
	{	RESERVE_PARA_298            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	100	,	0	,	}	,	//	298	预留用参数_298
	{	RESERVE_PARA_299            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	299	预留用参数_299
	{	USER_ARM_BUILD_YEAR          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	300	用户编程ARM编译年份
	{	USER_ARM_BUILD_DATE          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	301	用户编程ARM编译月日
	{	USER_ARM_BUILD_TIME          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	302	用户编程ARM编译时分
	{	OPEN_CLOSE_SPEED             	,	100	,	{	1	,	1	,	0	,	0	,	}	,	3000	,	0	,	}	,	//	303	开环收桨速度：27648对应最高转速
	{	POSITIONSKH                  	,	5	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	304	位置超差限制值高十六位
	{	POSITIONSKL                  	,	5	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	305	位置超差限制值低十六位
	{	POSITIONSK                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	306	位置超差故障
	{	ERR_RST                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	307	手动复位故障
	{	SEC_SCALE_A                  	,	30	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	308	第二编码器传递比分子，对应轮毂圈数
	{	SEC_SCALE_B                  	,	182	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	309	第二编码器传递比分子，对应编码器圈数
	{	GRAY_EN                      	,	1	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	310	格雷码解码允许
	{	SEC_POS_NUM                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	311	第二编码器圈数
	{	SEC_POS                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	312	第二编码器位置
	{	SAFE_CLOSE_SPEED             	,	300	,	{	1	,	1	,	0	,	0	,	}	,	2000	,	0	,	}	,	//	313	DSP自主收桨速度（单位0.01°/S，包含位置码异常开环收桨、与ARM通讯故障收桨、桨叶角度错误收桨）
	{	SAFE_CLOSE_UP_TIME           	,	44	,	{	1	,	1	,	0	,	0	,	}	,	30000	,	0	,	}	,	//	314	安全收桨上升梯度延时 1 = 10ms
	{	SAFE_CLOSE_DOWN_TIME         	,	44	,	{	1	,	1	,	0	,	0	,	}	,	30000	,	0	,	}	,	//	315	安全收桨下降梯度延时 1 = 10ms
	{	MOTOR_POS_RST                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	316	电机位置复位
	{	MOTOR_ANGLE                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	317	桨叶角度
	{	SEC_CODER_ANGLE              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	318	"第二编码器角度低16位	（	ID366为高16位）"
	{	SEC_CODER_OFFSET             	,	2048	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	319	第二编码器圈数偏移
	{	SEC_CODER_DIR                	,	1	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	320	第二编码器计数方向选择：0逆时针加计数，1顺时针加计数
	{	BK_SWITCH                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	2	,	0	,	}	,	//	321	制动器开关：0=制动器与使能联动；1=制动器关，2=制动器开
	{	SAFE_DI_DLY                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	2	,	}	,	//	322	安全链断开延时
	{	MOTOR_ANGLE_OFFSETH          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	323	电机角度零偏高十六位
	{	MOTOR_ANGLE_OFFSETL          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	324	电机角度零偏低十六位
	{	RESERVE_PARA_325            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	325	预留用参数_325
	{	RESERVE_PARA_326            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	326	预留用参数_326
	{	PITCH_PLC_STATE              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	327	驱动器状态机状态
	{	SERVICE_TIME_DELAY           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	328	手动正反速度延时
	{	RESERVE_PARA_329            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	329	预留用参数_329
	{	RESERVE_PARA_330            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	330	预留用参数_330
	{	RESERVE_PARA_331            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	331	预留用参数_331
	{	RESERVE_PARA_332            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	332	预留用参数_332
	{	RESERVE_PARA_333            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	333	预留用参数_333
	{	RESERVE_PARA_334            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	334	预留用参数_334
	{	RESERVE_PARA_335            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	335	预留用参数_335
	{	USER_PARA1_H                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	336	用户保存参数
	{	USER_PARA1_L                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	337	用户保存参数
	{	USER_PARA2_H                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	338	用户保存参数
	{	USER_PARA2_L                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	339	用户保存参数
	{	USER_PARA3_H                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	340	用户保存参数3
	{	USER_PARA3_L                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	341	用户保存参数3
	{	RESERVE_PARA_342             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	342	预留用参数_342
	{	RESERVE_PARA_343             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	343	预留用参数_343
	{	RESERVE_PARA_344             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	344	预留用参数_344
	{	RESERVE_PARA_345             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	345	预留用参数_345
	{	RESERVE_PARA_346             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	346	预留用参数_346
	{	RESERVE_PARA_347             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	347	预留用参数_347
	{	RESERVE_PARA_348             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	348	预留用参数_348
	{	RESERVE_PARA_349             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	349	预留用参数_349
	{	RESERVE_PARA_350             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	350	预留用参数_350
	{	RESERVE_PARA_351             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	351	预留用参数_351
	{	RESERVE_PARA_352             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	352	预留用参数_352
	{	RESERVE_PARA_353             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	353	预留用参数_353
	{	RESERVE_PARA_354             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	354	预留用参数_354
	{	RESERVE_PARA_355             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	355	预留用参数_355
	{	RESERVE_PARA_356             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	356	预留用参数_356
	{	RESERVE_PARA_357             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	357	预留用参数_357
	{	RESERVE_PARA_358             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	358	预留用参数_358
	{	RESERVE_PARA_359             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	359	预留用参数_359
	{	CONTROLWORD_DISP             	,	0	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	360	客户给定控制字送上位机显示
	{	TARGET_POSITION_L            	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	361	目标位置给定送上位机显示
	{	TARGET_POSITION_H            	,	0	,	{	1	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	362	目标位置给定送上位机显示
	{	DATAINIT_SELECT              	,	0	,	{	1	,	0	,	0	,	0	,	}	,	1	,	0	,	}	,	//	363	"上电初始化数值选择：0=eds默认值	1=FLASH存盘值 已不用"
	{	PITCH_SPEED                  	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32700	,	-32700	,	}	,	//	364	桨叶速度，单位°/S
	{	REAL_ANGLE                   	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	365	SSI桨叶绝对角度（0.01°） = SSI当前角度值 - SSI零点值（UserPara1）
	{	SEC_CODER_ANGLEH             	,	0	,	{	0	,	0	,	1	,	0	,	}	,	55536	,	0	,	}	,	//	366	"第二编码器角度高16位	（	ID318为低16位）"
	{	SAVE_PARA                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	367	只用于查询客户下发的save_para值，ReadPara(SAVE_PARA) = save_para;
	{	CHARGE_PARA_SAVE_EN          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	368	"充电器参数存盘使能	0=不允许存盘充电器参数，非0=运行存盘充电器参数"
	{	FAN_ON_DELAY                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	369	"使能开启后，风机的启动延时		单位ms"
	{	REAL_ANGLEH                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	370	SSI桨叶角度高16位
	{	CO_CONSUMER_HEARTBEAT_TIME   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	371	从站判断主站心跳时间
	{	ZLG7289_RES                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	372	消隐指令清除时间：0不发送清除指令，1手动发送一次指令
	{	BOFFCNT                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	373	CAN离线次数
	{	TECCNT                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	374	CAN发送错误计数器
	{	USER_PARA8                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	375	用户参数8
	{	USER_PARA9                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	376	用户参数9
	{	USER_PARA10                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	377	用户参数10
	{	C_VOL_ONOFF                  	,	125	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	378	IO24V输出关断母线电压值
	{	C_VOL_ONOFF_SEL              	,	1	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	379	IO24V输出关断电逻辑
	{	RESERVE_PARA_380             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	380	预留用参数_390
	{	RESERVE_PARA_381             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	381	预留用参数_390
	{	RESERVE_PARA_382             	,	0	,	{	1	,	1	,	1	,	0	,	}	,	65535	,	0	,	}	,	//	382	预留用参数_390
	{	RESERVE_PARA_383             	,	0	,	{	1	,	1	,	1	,	0	,	}	,	65535	,	0	,	}	,	//	383	预留用参数_390
	{	RESERVE_PARA_384             	,	0	,	{	1	,	1	,	1	,	0	,	}	,	65535	,	0	,	}	,	//	384	预留用参数_390
	{	RESERVE_PARA_385             	,	0	,	{	1	,	1	,	1	,	0	,	}	,	65535	,	0	,	}	,	//	385	预留用参数_390
	{	RESERVE_PARA_386             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	386	预留用参数_390
	{	RESERVE_PARA_387             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	387	预留用参数_390
	{	RESERVE_PARA_388             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	388	预留用参数_390
	{	RESERVE_PARA_389             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	389	预留用参数_390
	{	RESERVE_PARA_390             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	390	预留用参数_390
	{	RESERVE_PARA_391             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	391	预留用参数_391
	{	RESERVE_PARA_392             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	392	预留用参数_392
	{	RESERVE_PARA_393             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	393	预留用参数_393
	{	RESERVE_PARA_394             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	394	预留用参数_394
	{	RESERVE_PARA_395             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	395	预留用参数_395
	{	RESERVE_PARA_396             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	396	预留用参数_396
	{	RESERVE_PARA_397             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	397	预留用参数_397
	{	RESERVE_PARA_398             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	398	预留用参数_398
	{	RESERVE_PARA_399             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	399	预留用参数_399
	{	RESERVE_PARA_400             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	400	预留用参数_400
	{	POSITIONSKL2                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	401	位置超差计算值
	{	CAP_VOLT                     	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	402	AI0P反馈
	{	CAP_VOLT_OFFSET              	,	250	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	403	AI0P零偏
	{	CAP_VOLT_SCALE               	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	404	AI0P增益
	{	RESERVE_PARA_405             	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	405	位置误差阀值高16位
	{	RESERVE_PARA_406             	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	406	位置误差阀值低16位
	{	RESERVE_PARA_407             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	407	双驱主从机设置
	{	RESERVE_PARA_408             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	408	预留用参数_408
	{	RESERVE_PARA_409             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	409	预留用参数_409
	{	MOTOOVERLOADDISP	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	410	电机超载量反馈 单位1%
	{	MOTOOVERLOADMAXI             	,	114	,	{	1	,	1	,	0	,	0	,	}	,	155	,	1	,	}	,	//	411	电机超载最大电流
	{	MOTOOVERLOADTIMES            	,	4	,	{	1	,	1	,	0	,	0	,	}	,	20	,	0	,	}	,	//	412	电机超载延时时间
	{	MOTOOVERLOADI                	,	380	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	1	,	}	,	//	413	电机超载额定电流
	{	IGBTOVERTEMP1                	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	414	IGBT过热1触发条件
	{	DSP_AUTOSAFERUN_EN_DELAY     	,	300	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	415	DSP自主收桨开使能延时
	{	DSP_HEARTBEAT_COUNT          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	416	DSP心跳计数器
	{	DSP_AUTORUN_OVERTIME          	,	320	,	{	1	,	1	,	0	,	0	,	}	,	3200	,	1	,	}	,	//	417	DSP自主收桨超时时间（默认32S，包含位置码异常开环收桨、与ARM通讯故障收桨、桨叶角度错误收桨）
	{	MOTO_SAFE_TEMP1              	,	130	,	{	1	,	1	,	0	,	0	,	}	,	300	,	0	,	}	,	//	418	电机过热温度保护点1(130°)
	{	DEFECT_CODET                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	419	驱动器T16位故障(DSP扩展故障码)
	{	ALARM_MASKT                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	420	驱动器T16位故障屏蔽
	{	ALARM_AUTO_RST_ENT           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	421	驱动器T16位故障手自动复位
	{	DEFECT_CODET_SET             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	422	驱动器T16位故障码预留参数
	{	WORK_MOD_FEB             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	423	DSP当前实际控制模式反馈
	{	RESOLVER_ERR_RESET        	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	424	编码器故障复位（星辰协议下ID307无法复位编码器故障）
	{	ACTUALTORQUE            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	425	实际输出转矩
	{	RESERVE_PARA_426             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	426	预留用参数_426
	{	RESERVE_PARA_427             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	427	预留用参数_427
	{	RESERVE_PARA_428             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	428	预留用参数_428
	{	RESERVE_PARA_429             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	429	预留用参数_429；DSP_PARA_LEN=429，此后的ID不下传到DSP
																									
	{	430	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	430	
	{	431	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	431	
	{	432	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	432	
	{	433	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	433	
	{	434	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	434	
	{	435	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	435	
	{	436	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	436	
	{	437	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	437	
	{	438	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	438	
	{	439	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	439	
	{	440	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	440	
	{	441	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	441	
	{	442	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	442	
	{	443	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	443	
	{	444	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	444	
	{	445	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	445	
	{	446	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	446	
	{	447	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	447	
	{	448	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	448	
	{	449	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	449	
	{	450	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	450	
	{	451	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	451	
	{	452	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	452	
	{	453	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	453	
	{	454	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	454	
	{	455	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	455	
	{	456	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	456	
	{	457	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	457	
	{	458	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	458	
	{	459	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	459	
	{	460	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	460	
	{	461	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	461	
	{	462	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	462	
	{	463	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	463	
	{	464	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	464	
	{	465	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	465	
	{	466	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	466	
	{	467	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	467	
	{	468	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	468	
	{	469	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	469	
	{	470	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	470	
	{	471	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	471	
	{	472	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	472	
	{	473	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	473	
	{	474	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	474	
	{	475	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	475	
	{	476	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	476	
	{	477	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	477	
	{	478	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	478	
	{	479	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	479	
	{	480	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	480	
	{	481	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	481	
	{	482	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	482	
	{	483	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	483	
	{	484	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	484	
	{	485	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	485	
	{	486	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	486	
	{	487	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	487	
	{	488	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	488	
	{	489	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	489	
	{	490	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	490	
	{	491	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	491	
	{	492	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	492	
	{	493	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	493	
	{	494	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	494	
	{	495	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	495	
	{	496	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	496	
	{	497	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	497	
	{	498	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	498	
	{	499	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	499	
	{	500	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	500	
	{	501	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	501	
	{	502	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	502	
	{	503	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	503	
	{	504	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	504	
	{	505	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	505	
	{	506	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	506	
	{	507	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	507	
	{	508	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	508	
	{	509	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	509	
	{	510	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	510	
	{	511	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	511	
	{	512	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	512	
	{	513	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	513	
	{	514	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	514	
	{	515	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	515	
	{	516	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	516	
	{	517	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	517	
	{	518	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	518	
	{	519	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	519	
	{	520	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	520	
	{	521	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	521	
	{	522	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	522	
	{	523	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	523	
	{	524	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	524	
	{	525	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	525	
	{	526	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	526	
	{	527	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	527	
	{	528	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	528	
	{	529	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	529	
	{	530	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	530	
	{	531	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	531	
	{	532	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	532	
	{	533	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	533	
	{	534	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	534	
	{	535	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	535	
	{	536	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	536	
	{	537	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	537	
	{	538	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	538	
	{	539	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	539	
	{	540	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	540	
	{	541	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	541	
	{	542	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	542	
	{	543	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	543	
	{	544	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	544	
	{	545	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	545	
	{	546	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	546	
	{	547	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	547	
	{	548	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	548	
	{	549	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	549	
	{	550	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	550	
	{	551	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	551	
	{	552	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	552	
	{	553	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	553	
	{	554	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	554	
	{	555	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	555	
	{	556	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	556	
	{	557	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	557	
	{	558	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	558	
	{	559	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	559	
	{	560	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	560	
	{	561	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	561	
	{	562	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	562	
	{	563	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	563	
	{	564	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	564	
	{	565	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	565	
	{	566	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	566	
	{	567	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	567	
	{	568	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	568	
	{	569	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	569	
	{	570	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	570	
	{	571	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	571	
	{	572	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	572	
	{	573	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	573	
	{	574	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	574	
	{	575	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	575	
	{	576	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	576	
	{	577	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	577	
	{	578	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	578	
	{	579	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	579	
	{	580	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	580	
	{	581	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	581	
	{	582	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	582	
	{	583	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	583	
	{	584	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	584	
	{	585	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	585	
	{	586	,	5000	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	586	
	{	587	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	587	
	{	588	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	588	
	{	589	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	589	
	{	590	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	590	
	{	591	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	591	
	{	592	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	592	
	{	593	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	593	
	{	594	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	594	
	{	595	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	595	
	{	596	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	596	
	{	597	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	597	
	{	598	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	598	
	{	599	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	599	
	{	600	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	600	
	{	601	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	601	
	{	602	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	602	
	{	603	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	603	
	{	604	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	604	
	{	605	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	605	
	{	606	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	606	
	{	607	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	607	
	{	608	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	608	
	{	609	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	609	
	{	610	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	610	
	{	611	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	611	
	{	612	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	612	
	{	613	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	613	
	{	614	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	614	
	{	615	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	615	
	{	616	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	616	
	{	617	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	617	
	{	618	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	618	
	{	619	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	619	
	{	620	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	620	
	{	621	,	100	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	621	
	{	622	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	622	
	{	623	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	623	
	{	624	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	624	
	{	625	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	625	
	{	626	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	626	
	{	627	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	627	
	{	628	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	628	
	{	629	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	629	
	{	630	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	630	
	{	631	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	631	
	{	632	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	632	
	{	633	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	633	
	{	634	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	634	
	{	635	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	635	
	{	636	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	636	
	{	637	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	637	
	{	638	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	638	
	{	639	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	639	
	{	640	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	640	
	{	641	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	641	
	{	642	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	642	
	{	643	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	643	
	{	644	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	644	
	{	645	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	645	
	{	646	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	646	
	{	647	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	647	
	{	648	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	648	
	{	649	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	649	
	{	650	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	650	
	{	651	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	651	
	{	652	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	652	
	{	653	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	653	
	{	654	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	654	
	{	655	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	655	
	{	656	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	656	
	{	657	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	657	
	{	658	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	658	
	{	659	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	659	
	{	660	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	660	
	{	661	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	661	
	{	662	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	662	
	{	663	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	663	
	{	664	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	664	
	{	665	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	665	
	{	666	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	666	
	{	667	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	667	
	{	668	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	668	
	{	669	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	669	
	{	670	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	670	
	{	671	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	671	
	{	672	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	672	
	{	673	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	673	
	{	674	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	674	
	{	675	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	675	
	{	676	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	676	
	{	677	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	677	
	{	678	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	678	
	{	679	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	679	
	{	680	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	680	
	{	681	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	681	
	{	682	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	682	
	{	683	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	683	
	{	684	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	684	
	{	685	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	685	
	{	686	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	686	
	{	687	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	687	
	{	688	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	688	
	{	689	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	689	
	{	690	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	690	
	{	691	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	691	
	{	692	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	692	
	{	693	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	693	
	{	694	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	694	
	{	695	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	695	
	{	696	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	696	
	{	697	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	697	
	{	698	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	698	
	{	699	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	699	
	{	700	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	700	
	{	701	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	701	
	{	702	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	702	
	{	703	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	703	
	{	704	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	704	
	{	705	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	705	
	{	706	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	706	
	{	707	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	707	
	{	708	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	708	
	{	709	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	709	
	{	710	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	710	
	{	711	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	711	
	{	712	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	712	
	{	713	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	713	
	{	714	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	714	
	{	715	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	715	
	{	716	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	716	
	{	717	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	717	
	{	718	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	718	
	{	719	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	719	
	{	720	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	720	
	{	721	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	721	
	{	722	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	722	
	{	723	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	723	
	{	724	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	724	
	{	725	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	725	
	{	726	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	726	
	{	727	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	727	
	{	728	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	728	
	{	729	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	729	
	{	730	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	730	
	{	731	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	731	
	{	732	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	732	
	{	733	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	733	
	{	734	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	734	
	{	735	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	735	
	{	736	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	736	
	{	737	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	737	
	{	738	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	738	
	{	739	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	739	
	{	740	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	740	
	{	741	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	741	
	{	742	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	742	
	{	743	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	743	
	{	744	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	744	
	{	745	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	745	
	{	746	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	746	
	{	747	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	747	
	{	748	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	748	
	{	749	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	749	
	{	750	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	750	
	{	751	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	751	
	{	752	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	752	
	{	753	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	753	
	{	754	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	754	
	{	755	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	755	
	{	756	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	756	
	{	757	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	757	
	{	758	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	758	
	{	759	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	759	
	{	760	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	760	
	{	761	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	761	
	{	762	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	762	
	{	763	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	763	
	{	764	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	764	
	{	765	,	1	,	{	2	,	2	,	1	,	1	,	}	,	65536	,	1	,	}	,	//	765	
																									
	{	CHARG_DC24V_TEMP             	,	0	,	{	0	,	0	,	1	,	0	,	}	,	200	,	-40	,	}	,	//	766	充电器DC24V电源温度
	{	CHARG_AC_OFFEST              	,	0	,	{	0	,	0	,	0	,	0	,	}	,	255	,	0	,	}	,	//	767	相电压偏移量
	{	CHARG_SCR_CTR                	,	1	,	{	0	,	0	,	0	,	0	,	}	,	255	,	0	,	}	,	//	768	半控桥控制
	{	CHARG_AC_VOL                 	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65526	,	0	,	}	,	//	769	相电压检测
	{	CHARG_DEFECT_CODE            	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	770	充电器告警码
	{	CHARG_SYS_ST_CODE            	,	0	,	{	0	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	771	充电器系统状态
	{	CHARG_IGBT_TEMP              	,	0	,	{	0	,	0	,	1	,	0	,	}	,	200	,	-40	,	}	,	//	772	充电器IGBT温度
	{	CHARG_VOL                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	773	充电器母线电压
	{	CHARG_V_FEEDBACK             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	774	充电器电容电压
	{	CHARG_I_FEEDBACK             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	2000	,	0	,	}	,	//	775	充电器充电电流
	{	CHARG_ALARM_EN               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	776	充电器故障允许
	{	CHARG_ALARM_AUTO_RST_EN      	,	0x0172	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	777	充电器故障自动复位允许
	{	CHARG_ADDR                   	,	1	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	778	充电器通讯地址
	{	CHARG_BDR                    	,	1920	,	{	1	,	1	,	0	,	0	,	}	,	1920	,	0	,	}	,	//	779	充电器通讯波特率
	{	CHARG_TIM                    	,	10	,	{	1	,	1	,	0	,	0	,	}	,	100	,	10	,	}	,	//	780	充电器通讯周期
	{	CHARG_V_SET                  	,	450	,	{	1	,	1	,	0	,	0	,	}	,	500	,	1	,	}	,	//	781	充电器电压设定
	{	CHARG_I_SET                  	,	500	,	{	1	,	1	,	0	,	0	,	}	,	800	,	100	,	}	,	//	782	充电器电流设定
	{	CHARG_CTRL_REG               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	783	充电器控制寄存器
	{	CHARG_CTRL_MOD               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	784	充电器控制模式
	{	CHARG_INTERSPACE_TEMP        	,	0	,	{	1	,	1	,	1	,	0	,	}	,	200	,	-40	,	}	,	//	785	充电器内腔温度
	{	CHARG_ARM_BUILD_YEAR         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	786	充电器ARM编译年份
	{	CHARG_ARM_BUILD_DATE         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	787	充电器ARM编译月日
	{	CHARG_ARM_BUILD_TIME         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	788	充电器ARM编译时分
	{	CHARG_V_SET_BRAKER           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	300	,	0	,	}	,	//	789	抱闸电压设定：205代表205V
	{	CHARG_V_FEEDBACK_BRAKER      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1000	,	0	,	}	,	//	790	抱闸电压反馈：205代表205V
	{	CHARG_SN_BRAKER              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	791	抱闸使能控制：0=关抱闸；其他=开抱闸
	{	RTC_YEAR_SET                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	792	RTC年设置
	{	RTC_MONTH_AND_DATA_SET       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	793	RTC月日设置
	{	RTC_HOUR_AND_MINIT_SET       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	794	RTC时分设置
	{	RTC_SECON_SET                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	795	RTC秒设置
	{	RTC_YEAR_FEB                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	796	RTC年显示
	{	RTC_MONTH_AND_DATA_FEB       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	797	RTC月日显示
	{	RTC_HOUR_AND_MINIT_FEB       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	798	RTC时分显示
	{	RTC_SECON_FEB                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	799	RTC秒显示
	{	TCPSEL                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	800	TCP的选择
	{	TCPNETMASK1                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	801	子网掩码1
	{	TCPNETMASK2                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	802	子网掩码2
	{	TCPNETMASK3                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	803	子网掩码3
	{	TCPNETMASK4                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	804	子网掩码4
	{	TCPGATE1                     	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	805	网关1
	{	TCPGATE2                     	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	806	网关2
	{	TCPGATE3                     	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	807	网关3
	{	TCPGATE4                     	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	808	网关4
	{	TCPIP1                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	809	IP地址1
	{	TCPIP2                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	810	IP地址2
	{	TCPIP3                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	811	IP地址3
	{	TCPIP4                       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	812	IP地址4
	{	MACADDRESS1                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	813	物理地址macaddress1
	{	MACADDRESS2                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	814	物理地址macaddress2
	{	MACADDRESS3                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	815	物理地址macaddress3
	{	MACADDRESS4                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	816	物理地址macaddress4
	{	MACADDRESS5                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	817	物理地址macaddress5
	{	MACADDRESS6                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	255	,	0	,	}	,	//	818	物理地址macaddress6
	{	TCPCONTROL                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	1	,	0	,	}	,	//	819	1：TCP控制:0：TCP监控
	{	TCPCANOPENPRO                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	820	1：TCP控制具有优先权 ， 0：CANOPEN控制具有优先权
	{	PT100TYPE                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	821	PT100电路参数类型0=老电路；1=新电路；2=最新电路
	{	PARASAVEENABLE               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	822	抱闸电源异常、误触发、超限的故障属性默认值允许修改：=0xAA55允许修改；其他不允许
	{	CHARG_CAP                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	823	超级电容容量 20000对应2F
	{	CHARG_BTMVOL               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	824	BTM电压：精度1V
	{	CHARG_ADC_RESET_TIMES         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	825	充电器AD模块复位次数
	{	CURRENT_ACTUAL_VALUE         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	826	未经滤波的电流值
	{	VELOCITY_SENSOR_ACTUAL_VALUE 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	827	未经滤波的速度值
	{	ARM_RESERVE_PARA_828      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	828	ARM Boot版本（来自0x08004000的"H6_Boot:xxx"）
	{	ARM_RESERVE_PARA_829      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	829	ARM预留用参数_829
	{	ARM_RESERVE_PARA_830      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	830	ARM预留用参数_830
	{	ARM_RESERVE_PARA_831      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	831	ARM预留用参数_831
	{	ARM_RESERVE_PARA_832      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	832	ARM预留用参数_832
	{	ARM_RESERVE_PARA_833      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	833	ARM预留用参数_833
	{	ARM_RESERVE_PARA_834      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	834	ARM预留用参数_834
	{	ARM_RESERVE_PARA_835      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	835	ARM预留用参数_835
	{	ARM_RESERVE_PARA_836      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	836	ARM预留用参数_836
	{	ARM_RESERVE_PARA_837      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	837	ARM预留用参数_837
	{	ARM_RESERVE_PARA_838      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	838	ARM预留用参数_838
	{	ARM_RESERVE_PARA_839      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	839	ARM预留用参数_839
	{	ARM_RESERVE_PARA_840      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	840	ARM预留用参数_840
	{	OVER_POSITION             	,	3200	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	841	桨叶位置超限阀值
	{	POWER75_OVER_TEMP         	,	95	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	842	开关电源过温阀值
	{	SDCARD_ERRCODE            	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	843	SD卡错误码
	{	ARM_RESERVE_PARA_844      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	844	ARM预留用参数_844
	{	ARM_RESERVE_PARA_845      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	845	ARM预留用参数_845
	{	ARM_RESERVE_PARA_846      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	846	ARM预留用参数_846
	{	DEFECT_CODEM                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	847	驱动器M16位故障码
	{	ALARM_MASKM                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	848	驱动器M16位故障屏蔽
	{	ALARM_AUTO_RST_ENM           	,	0x0001	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	849	驱动器M16位故障手自动复位
	{	DEFECT_CODEM_SET             	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	850	驱动器M16位故障码预留参数
	{	CLEAR_STARS_PARA_CMD         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	851	擦除SD卡星辰参数命令：1=擦除用户参数；2=擦除出厂参数；3=擦除用户参数和出厂参数
	{	ARM_RESERVE_PARA_852         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	852	ARM预留用参数852
	{	ARM_RESERVE_PARA_853         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	853	ARM预留用参数853
	{	ARM_RESERVE_PARA_854         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	854	ARM预留用参数854
	{	ARM_RESERVE_PARA_855         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	855	ARM预留用参数855
	{	ARM_RESERVE_PARA_856         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	856	ARM预留用参数856
	{	ARM_RESERVE_PARA_857         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	857	ARM预留用参数857
	{	ARM_RESERVE_PARA_858         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	858	ARM预留用参数858
	{	ARM_RESERVE_PARA_859         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	859	ARM预留用参数859
	{	ARM_RESERVE_PARA_860         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	860	ARM预留用参数860
	{	ARM_RESERVE_PARA_861         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	861	ARM预留用参数861
	{	ARM_RESERVE_PARA_862         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	862	ARM预留用参数862
	{	ARM_RESERVE_PARA_863         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	863	ARM预留用参数863
	{	ARM_RESERVE_PARA_864         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	864	ARM预留用参数864
	{	ARM_RESERVE_PARA_865         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	865	ARM预留用参数865
	{	ARM_RESERVE_PARA_866         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	866	ARM预留用参数866
	{	ARM_RESERVE_PARA_867         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	867	ARM预留用参数867
	{	ARM_RESERVE_PARA_868         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	868	ARM预留用参数868
	{	ARM_RESERVE_PARA_869         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	869	ARM预留用参数869
	{	DSP_HEARTBEAT_COUNT1         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	870	DSP心跳翻转计数器（DSP每2ms翻转一次心跳位,ARM每1ms轮询一帧数据）
	{	ARM_RESERVE_PARA_871         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	871	ARM预留用参数871
	{	ARM_RESERVE_PARA_872         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	872	ARM预留用参数872
	{	ARM_RESERVE_PARA_873         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	873	ARM预留用参数873
	{	AI2P_SEL                   	,	1	,	{	1	,	0	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	874	AI2P功能选择
	{	AI2P_DISP                  	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	875	AI2P反馈
	{	AI2P_OFFSET                	,	300	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	876	AI2P零偏
	{	AI2P_SCALE                 	,	3360	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	877	AI2P增益
	{	ARM_RESERVE_PARA_878         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	878	ARM预留用参数878
	{	ARM_RESERVE_PARA_879         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	879	ARM预留用参数879
	{	ARM_RESERVE_PARA_880         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	880	ARM预留用参数880
	{	ARM_RESERVE_PARA_881         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	881	ARM预留用参数881
	{	MOTO_ADDR_DISPL              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	882	旋变存盘的最新地址低16位送上位机显示
	{	MOTO_ADDR_DISPH              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	883	旋变存盘的最新地址高16位送上位机显示
	{	MOTO_ANGL_DISPL              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65436	,	0	,	}	,	//	884	旋变存盘的最新数值L16位送上位机显示
	{	MOTO_ANGL_DISPH              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65436	,	0	,	}	,	//	885	旋变存盘的最新数值H16位送上位机显示
	{	MOTO_ANGL_TEST               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	886	旋变存盘角度测试8=写入；9=擦除
	{	MOTO_ANGL_DISPC              	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	887	旋变存盘的最新数值C16位送上位机显示
	{	MOTO_ANGL_SAVE_MIN_VOL       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	888	旋变掉电保存母线下限值 已固化90V
	{	MOTO_ANGL_SAVE_MAX_VOL       	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	889	旋变掉电保存母线上限值 已固化160V
	{	FASTVOL                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	890	快速上传的母线电压值
	{	CRC_ERRCNT                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	891	CRC错误计数器
	{	CRC_RIGCNT                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	892	CRC正确计数器
	{	P_MAX_V                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	893	位置环下的最高转速
	{	SSI_ANGLE                    	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	894	SSI角度
	{	MOTO_ANGLE_SET               	,	65535	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	895	使用此参数设置旋变角度：上电默认=65535，除此数值以外任何角度都可设置
	{	SAFE_SPEED_ADD               	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	896	安全收桨速度切换递增值
	{	USERPARA5                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	897	用户参数5
	{	USERPARA6                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	898	用户参数6
	{	USERPARA7                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	899	用户参数7
	{	USERPARA8                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	900	用户参数8
	{	USERPARA9                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	901	用户参数9
	{	USERPARA10                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	902	用户参数10
	{	ERRSAVE_ADDR_ERASE           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	903	历史故障扇区擦除：上电若不等于0xAA55就执行一次历史故障信息扇区擦除操作，随后保存此参数为0xAA55
	{	USERPARAVALIFYDATA0           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	904	用户参数扇区头地址校验字节，正常时应为：0x080C 0000=0xAA、0x080C 0001=0x55
	{	USERPARAVALIFYDATA1           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	905	用户参数扇区尾地址校验字节，正常时应为：0x080D FFFE=0xAA、0x080D FFFF=0x55
	{	DEFTPARAVALIFYDATA0           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	906	出厂参数扇区头地址校验字节，正常时应为：0x080E 0000=0xAA、0x080E 0001=0x55
	{	DEFTPARAVALIFYDATA1           	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	907	出厂参数扇区尾地址校验字节，正常时应为：0x080F FFFE=0xAA、0x080F FFFF=0x55
	{	PARAVALIFYERR                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	908	0=校验全部正确；1=用户参数头地址校验错误；2=用户参数头尾地址校验错误；3=用户和出厂参数头地址校验错误；4=用户和出厂参数头尾地址校验错误
	{	ARM_RESERVE_PARA_909         	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	909	ARM预留用参数_909
	{	CABINET_TEMP_ADJ0            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	910	PT100通道0校准参数
	{	CABINET_TEMP_ADJ1            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	911	PT100通道1校准参数
	{	CABINET_TEMP_ADJ2            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	912	PT100通道2校准参数
	{	CABINET_TEMP_ADJ3            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	913	PT100通道3校准参数
	{	SAFERUN_T1T2                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	914	分段式收桨第1、第2段时间 单位S
	{	RESERVE_915                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	915	预留参数_915
	{	SAFERUN_V1V2                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	916	分段式收桨第1、第2段速度百分比 单位X%
	{	RESERVE_917                 	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	917	预留参数_917
	{	CONFIGWORDS                  	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	918	Bit3~Bit0为分段式收桨功能、Bit7~Bit4为轮毂温度和C+C-湿度分时复用：A=启用；其他=禁止
	{	SAFERUN_MULTIPLE_CNT          	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65436	,	0	,	}	,	//	919	分段式收桨功能计时器 单位S
	{	OUT8_SEL                     	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	920	OUT08输出功能选择
	{	OUT9_SEL                          	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	921	OUT09输出功能选择
	{	OUT10_SEL                    	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	922	OUT10输出功能选择
	{	OUT11_SEL                    	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	923	OUT11输出功能选择
	{	OUT12_SEL                    	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	924	OUT12输出功能选择
	{	OUT13_SEL                    	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	925	OUT13输出功能选择
	{	OUT14_SEL                    	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	926	OUT14输出功能选择
	{	OUT15_SEL                    	,	32	,	{	1	,	1	,	0	,	0	,	}	,	47	,	0	,	}	,	//	927	OUT15输出功能选择
	{	CABINET_TEMP_ADJ4            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	928	PT100通道4校准参数
	{	CABINET_TEMP_ADJ5            	,	3300	,	{	1	,	1	,	0	,	0	,	}	,	3600	,	3000	,	}	,	//	929	PT100通道5校准参数
	{	TEMP3                        	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	930	T3温度
	{	TEMP4                        	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	931	T4温度
	{	CABINET_TEMPx                	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	932	Tx温度(预留)
	{	ABPULSENUM                   	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	933	AB编码器线数
	{	ABSPEED                      	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	934	AB编码器实际转速，精度0.1RPM
	{	ABSPEEDFILTER                	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	935	AB编码器转速滤波系数
	{	ABPARA1                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	936	AB编码器预留用参数1
	{	ABPARA2                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	937	AB编码器预留用参数2
	{	ABPARA3                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	938	AB编码器预留用参数3
	{	ABPARA4                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	939	AB编码器预留用参数4
	{	ABPARA5                      	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	940	AB编码器预留用参数5
	{	AI1P_DISP                    	,	0	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	941	AI1P反馈
	{	AI1P_OFFSET                                       	,	300	,	{	1	,	1	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	942	AI1P零偏
	{	AI1P_SCALE                   	,	3360	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	943	AI1P增益
	{	PITCH_ANGLE                  	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	944	桨叶角度(ARM解析 精度0.01°)
	{	PITCH_ANGLE1                 	,	0	,	{	0	,	0	,	1	,	0	,	}	,	32767	,	-32767	,	}	,	//	945	桨叶角度(精度1°，仅用于监控位置超限3200°)
																									
	{	946	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	946	预留参数_946
	{	947	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	947	预留参数_947
	{	948	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	948	预留参数_948
	{	949	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	949	预留参数_949
	{	950	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	950	预留参数_950
	{	951	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	951	预留参数_951
	{	952	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	952	预留参数_952
	{	953	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	953	预留参数_953
	{	954	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	954	预留参数_954
	{	955	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	955	预留参数_955
	{	956	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	956	预留参数_956
	{	957	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	957	预留参数_957
	{	958	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	958	预留参数_958
	{	959	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	959	预留参数_959
	{	960	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	960	预留参数_960
	{	961	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	961	预留参数_961
	{	962	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	962	预留参数_962
	{	963	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	963	预留参数_963
	{	964	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	964	预留参数_964
	{	965	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	965	预留参数_965
	{	966	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	966	预留参数_966
	{	967	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	967	预留参数_967
	{	968	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	968	预留参数_968
	{	969	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	969	预留参数_969
	{	970	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	970	预留参数_970
	{	971	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	971	预留参数_971
	{	972	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	972	预留参数_972
	{	973	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	973	预留参数_973
	{	974	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	974	预留参数_974
	{	975	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	975	预留参数_975
	{	976	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	976	预留参数_976
	{	977	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	977	预留参数_977
	{	978	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	978	预留参数_978
	{	979	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	979	预留参数_979
	{	980	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	980	预留参数_980
	{	981	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	981	预留参数_981
	{	982	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	982	预留参数_982
	{	983	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	983	预留参数_983
	{	984	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	984	预留参数_984
	{	985	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	985	预留参数_985
	{	986	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	986	预留参数_986
	{	987	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	987	预留参数_987
	{	988	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	988	预留参数_988
	{	989	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	989	预留参数_989
	{	990	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	990	预留参数_990
	{	991	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	991	预留参数_991
	{	992	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	992	预留参数_992
	{	993	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	993	预留参数_993
	{	994	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	994	预留参数_994
	{	995	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	995	预留参数_995
	{	996	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	996	预留参数_996
	{	997	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	997	预留参数_997
	{	998	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	998	预留参数_998
	{	999	,	0	,	{	1	,	1	,	0	,	0	,	}	,	65535	,	0	,	}	,	//	999	预留参数_999
} ;

u16 DefaultParaTableNum = DEFAULTPARATABLE_LEN;
